{"posts":[{"title":"Startup Log: Bayesians","text":"On April 17, 2025, our team incorporated in the United States. Although the final approval came the next day, we designated my birthday, April 17th, as our Day One. This post is a record of the 90-day journey of our team’s formation, from January 17th to April 17th, 2025. The Beginning of a LegendIn mid-January, after parting ways with the connection I made at Antler, I became an individual again. I continued to work alone afterwards, but looking back, I think I felt a sense of hopelessness at that time. I didn’t think it was absolutely necessary to work with someone, but working alone, I felt like I was only thinking within the limits of my own abilities. The business I was considering at the time was a personal information management service. Among them, I was thinking of summarizing and organizing newsletters, because that was a problem I had. When I felt that my problems were limited to what I intuitively felt and understood, I started to think, ‘a co-founder is essential for me.’ I immediately posted on LinkedIn asking for coffee chats. I wasn’t thinking of finding a co-founder right away. As I wrote in the post, it was a time when I thought that the process of starting a company should be viewed with a very, very long-term perspective, so I wrote the post with the thought of charging up my ideas and making as many connections as possible. Amazingly, it got 13,790 impressions. I think it was the most widespread post I’ve ever written. As much as it spread, a lot of people asked for a coffee chat. In one week, I made 22 appointments with 19 people. There were also requests for coffee chats like ‘looking for a free developer.’ “I don’t have a developer,” “I have something I really want to try.” In such cases, I told them I wasn’t joining the team and asked if a coffee chat would still be okay. Without exception, every single one decided not to meet and wished me well. MJ was one of the 19 people, and someone I met twice. MJ was fashionably late for our first meeting and bought lunch. When I met him then, we talked casually, and as always, I tried hard to see his motivation for starting a company and the size of his dream. For our second meeting at a cafe, we each prepared answers to First Round’s 50 Questions for Co-Founders and compared them. Looking at my personal retrospective from the 4th week of January, I felt that our answers to the 50 Questions matched well, and I was satisfied with our expectations for each other and our attitude towards entrepreneurship. But the most satisfying point was that he wanted to put a 10-15 year cliff on the co-founder. It seemed like he was just as interested as I was in preventing the co-founder from leaving, and I thought, ‘this person will live and breathe entrepreneurship until the end!’ We started working together in earnest the following week. Agreed-Upon Goals and Team ColorWe both had the basics of going to the US and building a global service from Day 1. Our criteria, since we hadn’t decided on a specific domain for this business, was to solve a problem that could become at least a $1B company. We figured that if the global market is around $50T to $100T, we could reach that goal regardless of the segment we entered. The first area we tried to work on together was the researcher’s domain. We saw that, just as Cursor did, we could create an optimal UX in the pattern of how researchers read and organize papers. After interviewing about 10 researchers, we confirmed the same pattern and approached the first product as a kind of Notion for Researchers. We built and deployed a service with an editing tool for organizing like Notion, a PDF viewer, and a RAG that understood PDFs very well in just 3 days. We talked to some of the people we had interviewed again, but the value we were delivering was very vague. Looking back now, I think we were also wondering, ‘is this really the right product to optimize the pattern we saw in the interviews?’ When I first thought about this area, I wondered, ‘is it right to dig into such a narrow market…’ And I still have that thought to some extent. As a result, in the process of getting more specific in this area, our customer segment became even narrower, and we judged that the scale would not match our goals, so we moved on to another item. What was meaningful in this process was that I got a rough idea of what it would be like to work with MJ. We are very impatient people. The team has a driving force to make everything other than the conclusion secondary and rush towards the conclusion. This quality doesn’t always yield positive results, but I think it will be quite useful in the future. We both use reason well. We know how to think about what kind of evidence is needed to be rational when defining a problem or persuading others. We seem to like working to a similar extent. When meeting co-founders, everyone always says they like to work, but when you look at how much time they need to work to maintain a sustainable level, it’s rare to find a perfect match. I wonder if it’s not sustainable to work more if you really enjoy it, and in that sense, we seem to enjoy working similarly. An Area We’re Okay With for a Long TimeAfter that, we thought up and validated ideas very quickly. We had about five ideas before the one we’re working on now, and we checked one item almost every week. I was continuing with the thought that finding an item wouldn’t be easy, but it was a shame that when the item changed at the domain level, the team’s know-how and lessons learned, even if small, became meaningless. So I thought it would be better if we could pivot and move forward within an area that we were okay with for a quite a long time. The first domain we worked on for more than 2 weeks was ‘animation.’ 2D Animation is a content area that MJ is attached to, and he had conducted related AI research before graduating. I, too, haven’t reached the level of an otaku, but I’ve enjoyed watching 2D animation since I was young. At first, we thought about an AI tool for animation production, but by combining the thoughts within the team and the thoughts of those who were helping us, we are moving in a direction that can also reach the consumer side. The consumer side is more an area of fun than a problem area, so I think it requires faith rather than logic. There is a belief that if we can reduce the cost of creating good content by 1/10000 based on the founders’ personal experiences, we can succeed, and there is a belief that we are the people who are good at this. Right now, we are adopting and automating Wattpad’s multi-million view works with AI Animation. We are collaborating closely with the original author, and fortunately, they are reacting positively to the initial quality of the AI Anime. I feel more and more that we are approaching the ‘on-time’ for a major service to emerge in the AI video space. Even if the quality we produce right now is lacking or the cost is high, like GPT, it will soon drop to the consumer level, get faster, and get better. I feel like we are preparing for that on-time. Succeeding or in the Process of Succeeding I really like the way Noh Hong-chul thinks. On Pani Bottle’s channel, what Hong-chul said while traveling with Bottle almost perfectly matches my thoughts. To the question, ‘How do you only do what you want to do and everything works out?’, he replied, ‘I did it until it worked out.’ Until you give up, you are in the process of succeeding. In that sense, a team that doesn’t seem like it will give up is the same as a team that doesn’t seem like it will fail. In my opinion, our current team is a team that is unlikely to fail unless a situation arises where it is impossible to work due to serious injury or illness of an individual or family member. As we move towards success, we will be joined by many people, and I hope they also get the feeling that we are a ‘team that will make it happen no matter what.’ Day 1 For a combination of reasons, we quickly set up a US corporation. Launching the corporation on my birthday seems to create another attachment. Bayesians is a name I had been using for organizations in various situations since starting my company last year. It’s closely related to AI, but I chose the name because I believe that people who can think about conditional probability can increase their win rate in decision-making. MJ said the name sounded good, so we’ve been using it as our team name regardless of the item. We’ve been in stealth mode until now, but I think we’re now in a state where we can definitively reveal the team.","link":"/posts/logs/20250420/"},{"title":"2024: A Year-One Founder&#39;s Retrospective","text":"I started this blog on January 1, 2019, as I began my journey into programming. It’s been six years now, and for the first time, I’m writing a retrospective as a “Year-One Founder,” someone awkwardly positioned between an entrepreneur and a developer. Choosing this title feels refreshingly different. Last year’s me spent the year solidifying my dream and removing obstacles in my way; this year was the first I actually dove into entrepreneurship. It seems that starting a company generally forces you into a state of discomfort in most areas, which can lead to immense growth. That’s why this year I learned so much that the process of distilling it all took longer than anything else. It was such a fun year that I regret not being able to record everything I learned. I regret not having written a single blog post since starting my company. I actually had things to write about in between, but I was also curious to see what it would look like for the post after my 2023 retrospective to be the 2024 retrospective. Goals for 2024On January 1, 2024, I set new goals for the year, which were as follows: Get a place in Seoul. (Move out!) Generate enough income to sustain the startup. Build a founding team. Find Product-Market Fit (PMF). Get healthier. Read over 15 books (5 each on AI, business, and humanity!). To summarize my current situation: I am living in Seoul, and money is coming in to sustain the startup. I’ve also read more than 15 books. However, I seem to have failed at getting healthier. In fact, I think I’ve regressed, with most of the decline happening in Q4. This retrospective focuses on two things I haven’t talked about yet. The journey of finding a founding team and the quest for PMF were my main goals this year. I also read so many fascinating books that there’s a lot I want to document, but I’ll try to record that separately. Table of Contents for 2024My year can be divided into three phases: the early phase of leaving my job and preparing for the startup; the middle phase of building a product and meeting countless people to find a co-founder; and the final phase of participating in Antler, a startup generation program run by a global VC (hereafter referred to as Antler). The search for both an idea and a person is largely divided along these lines. Ready, Set, Startup! I spent the first quarter of this year preparing to launch my startup. On January 2nd, I informed my team leader of my intention to leave and started creating a departure plan with my colleagues at Ohouse. We discussed when I would leave, what I would do during that time to avoid slacking off, and how I would hand over my responsibilities. While I can’t say the departure process was perfectly clean, it wasn’t messy either. As cash became increasingly important for me, I felt I would regret it later if I didn’t take every last bit of goodwill the company offered. However, I couldn’t wait long enough for salary negotiations or for my stock options to fully vest. So, my departure was set for the end of February. During that time (aside from company work), I started studying AI and tentatively meeting people. Let’s Explore AI TechnologyEarly this year, I read an article titled “Re-reading ‘W’ at this point in time“. It reminded me of how, after seeing the SORA demo in 2023, I became convinced that the next ‘W’ would be AI. And so, I began my studies. I studied the fundamental math and technical concepts behind AI, and as a user of the models, I also studied how to use them effectively. While I found some aspects of studying the basics and the technology itself interesting, I often thought that I didn’t need to build it myself. It felt similar to how I understand the components and protocols that make up a computer network, but don’t need to build them from scratch. I focused my studies and practice on how to better use the models from a user’s perspective. Naturally, I ended up studying a lot of Prompt Engineering, LLMOps, and the like. Fortunately, my judgment at the time seems to have been quite sound. To this day, the basic concepts I studied properly help me better understand how to use the models, and more importantly, I’m still making good use of the application-level knowledge I gained back then. In particular, a product I was working on in the middle was a Full-stack AI builder, like Lovable or Marblism. I used AI very intensively at that time, which I think pushed me to study and use more than just the simple stuff. Let’s Explore AI BusinessWhile studying the technology, I simultaneously studied AI-powered businesses. It was more like a series of case studies, conducted through an activity called the AI Research Club. It was a study group where a VC host would share insights on AI-related businesses and provide good articles to read, and people would study them. I was introduced to the “Re-reading ‘W’” article there, and I was introduced to and collected many other interesting articles as well. Honestly, when I first started, I was hoping to meet entrepreneurs who wanted to ride the AI wave, but unfortunately, I didn’t end up staying in touch with anyone from there. However, I quite liked the activity itself. Re-reading ‘W’ at this point in timeA surgeon was invited by an acquaintance to a special lecture. He squeezed it into his busy schedule, and the speaker, W, wrote WWW on the board and gave a lecture on the theme ‘The Internet will rule the world.’ The surgeon thought it was crazy and scolded his acquaintance for inviting him. In contrast, a friend who attended with him sought out W, asked to learn more, followed him, and made a life-changing bet (a business). That business grew to be worth over 2 trillion won, and the speaker, W, is said to be Lee Jae-woong, the founder of Daum. The surgeon pondered, ‘We heard the same lecture, so why did I hear it as crazy talk, while my friend could make a life-changing bet?’ He says he found the answer from Jeremy Rifkin. We often say that ‘humanity has contributed’ to our current civilization, but in reality, human history is a history created by 1%. The 1% pioneers new civilizations, while the other 99% of humanity are ‘surplus humans’ who follow along, saying things like, “The world has gotten so much better,” or “Technology is advancing so fast.”The 1% is further divided into two groups: the 0.1% who create new domains, and the 0.9% who, with insight, leap into that world. In the story, Lee Jae-woong is the 0.1%, his friend is the 0.9%, and the surgeon is the 99%. Ford was the 0.1%, Rockefeller the 0.9%, and the rest were the 99%.The internet is a proven innovation in human civilization. Therefore, as we read this, it might not seem so difficult to become part of the 0.9%. However, in our current uncertain situation, we must be able to distinguish between the Don Quixotes and the real deal. The period after I left my company can be largely divided into two phases: Before Antler (BA) and After Antler (AA). This distinction applies to my reflections on both finding a co-founder and finding PMF. The Quest for a Co-founderWhile I started meeting people on January 1st, I think my focused search for a co-founder began in early March. The channels I used to meet people, excluding Antler, were introductions from acquaintances, direct messaging on LinkedIn, and Y Combinator’s Co-Founder matching platform. I met nearly 50 people outside of Antler, and about 80 people within Antler. Naturally, I met some very impressive people, and I also became good friends with some of them along the way. As I searched for a co-founder, I met many people who were striving to achieve their goals by stepping out of their comfort zones. I had the opportunity to hear about their journeys, gain fresh perspectives on similar situations, and have interesting conversations. Thinking back on it now as I write this retrospective, I feel a sense of thrill knowing that I’ll be meeting more people like this in the future and will likely be working with them. Who Can I Spend a Long Time With?But joy is joy, and the journey of finding a co-founder itself was incredibly arduous. I think I had been vaguely thinking about ‘what kind of person should I work with?’ while preparing to leave my job last year. And from January 1st, as I started meeting people, I began to solidify these thoughts. In the past, I once turned down a co-founder position and decided to leave a company. How was this decision made? While the negotiations involved reviewing even minor phrases, there was really one major reason. I had too many other things I wanted to do besides starting a company. I had a strong desire to become an exceptionally skilled engineer, and I vaguely wanted to work in the United States. At the time, the co-founder position was not the fastest or surest path to satisfying both of those desires. So, I think I hesitated greatly at a role that contractually required a long-term commitment. In other words, I was not a suitable candidate for a co-founder. Deciding to leave right before an investment might have been a relief for the team in some ways, but looking back now at this point of starting my own company, I also suspect the CEO must have felt some pain, however brief. In any case, I thought, ‘When I’ve grown more, another great opportunity like this will come,’ and I left to pursue the other goals that were holding me back. Now, I’ve taken care of all those things, and the only remaining goals in my life are things to be achieved through entrepreneurship. I want to build a company with an excellent person for as long as possible. To do that, I need to be able to filter out people like the ‘2019 version of Changhoi Kim.’ So, the most important thing I looked for was the motivation for starting a company. Why do you want to start a company? I tried my best to listen for whether they had some ultimate life goal that could only be achieved through entrepreneurship, something worth dedicating a long period of their life to. And at that time, I thought about ‘how could a team fall apart?’ and came up with a few things. Someone with a dream as big as mine: I thought this was necessary because of my criterion of wanting to work with someone for a long time. The size of the dream can be thought of as the size of the target business. Even if we find PMF after many struggles, if it’s clear that the cap is limited when we reach the very end, I want them to be able to boldly suggest we try something else. Someone not tied to a specific domain: I worried that if someone is tied to a specific domain, the team might fall apart if we fail to find a problem in that area. Someone who enjoys work: I hope they can enjoy working without feeling stressed about working a lot. Someone confident in learning: A ‘I can just learn it’ mindset is needed even in unfamiliar areas, and I think it’s related to pure intelligence. It also becomes an advantage in being able to try various domains. Meeting 40-50 people before Antler, I realized that it’s difficult to guess the four points above after just a few conversations. Since I’m using a very personal checklist that can’t be made into a ‘Work Enjoyment Ability Test’ or ‘Learning Confidence Qualification Exam,’ we often use the same words but picture different things. So, I decided to focus on asking about their motivation for starting a company, and for the rest, while I’d talk about it, I figured I’d have to find out by doing something together. Before Antler (BA)As I mentioned above, before Antler started, I frequently used LinkedIn and the YC Co-Founder Matching platform. I wasn’t able to build something with any of the people I met then. Why was that? Among people who are starting a company, there are almost none who are solely focused on finding a co-founder while putting everything else on hold. Everyone has an idea or two they’re working on and is looking for someone interested in that. But when two people who are both trying to start a company just meet, and one asks the other to join their current project, I wonder how often the other person agrees and starts. So, I wonder how it would have been if I had focused on trying to work together, even if it meant stopping what I was doing at the time. On the other hand, I also think that those criteria might be stricter than I thought. They were so strict that I don’t think I ever felt like ‘I need to stop what I’m doing and do something more with this person.’ In particular, the condition of having something that can only be achieved through entrepreneurship, while not being tied to any specific domain, might be difficult to reconcile. I myself have a long-term goal of eventually getting into the energy domain. However, because I see this as a goal to be reached gradually over a long period of my life, I’m not particularly tied to this domain right now. If it’s not a case like this, it’s hard to find someone who wants to pour a huge amount of time into this without wanting to solve a problem in a specific domain. The fact that I did Antler means that I ultimately failed to find a co-founder during this period, but I did meet some truly grateful connections. There were people who, while not immediately interested in starting a company, directly helped me build my product, and I even met someone who let me have a room in their house for the summer. I really felt that you have to take some action, any action, to make these kinds of connections and move forward, even if just a little. I met the kind person who helped me move out during the unbearably hot, air-conditioner-less summer through YC. Our timing didn’t align for us to team up, but living in Seoul for the summer allowed me to meet many more people easily, made it easier to find my current place, and above all, allowed me to get by without any trouble. As someone who also has a high understanding of startups, I would occasionally ask for their opinion on my situation. They had done the Antler batch right before me, recommended it, and that’s how I ultimately decided to do Antler. I haven’t been able to offer any help in return, but I hope a day comes when I can repay their kindness, and we keep in touch occasionally. There was also someone who was interested in the product I was working on, so we started a project together. The idea changed midway, and they might have lost interest, but they even helped with the next idea. This person is also a really smart and admirable friend, and we’re on good terms. I hope I can be of help to them someday too. After Antler (AA)Antler was a gracious program that handled most of the cycle of ‘finding, contacting, and talking to’ entrepreneurs for me. I’m not someone who sets many goals to decide on the next action, so I participated in Antler with the sole objective of ‘finding a co-founder.’ However, as I met around 80 entrepreneurs, I formed valuable connections regardless of co-founding, and also had experiences that changed some of my existing thoughts. During the Official Program PeriodHowever! Still! The process of finding a co-founder was not easy. Even when you gather 80 talented people who want to start a company, you can clearly distinguish between those you would start a company with and those you wouldn’t, based on your own criteria. So, worrying about ‘there are 80 people, how will I ever try them all out~’ is a pretty meaningless concern. During the official period of a little over a month and a half, we had to change teams about 10 times to build ideas, and I think I tried working with a lot of people then. In particular, I think I was able to try more because I rarely overlapped with people on teams. Among them, twice I even did the 50 Questions for Co-Founders (Antler seems to provide a simple Korean translation!) and had deep talks about equity, experiencing the process of developing into a founding team. The first team was one I was personally excited about, but it ended before we could do much. The co-founder mentioned that as they participated in Antler, they realized their desired domain was more defined than they thought. And that part, in my opinion, was too narrow and didn’t meet the criteria I mentioned above. This was a surprisingly common case among Antler participants. They thought they weren’t particularly tied to a domain, but as they worked, they realized they didn’t want to do anything outside their area of interest. It wasn’t that I didn’t have any of that, but rather than developing a ‘domain I must do,’ I developed ‘domains I don’t want to do.’ I usually felt excited if I could imagine the final form being substantial in scale, but I couldn’t find any interest in EdTech. The next team also felt like an ideal team, but it fell apart because our working styles didn’t match well. The older colleagues I met then were, and I’m not just saying this, people with so much to learn from, kind, and people I wanted to stay close with for a long, long time, but a few communication issues arose while working together. Looking back now, I wonder if we could have resolved it with close feedback. Perhaps because I felt it was so ideal, I think I kept nagging and pushing. I didn’t think it was strange to demand a high standard that was difficult for anyone (including myself, of course) to meet, from people who had come together to create something truly extraordinary. The team leader at the time seemed to view the discord at that point as a difference in nature that would likely be difficult to tune. I think this friction would have come up eventually even if I hadn’t been nagging and pushing this time, so I don’t think they made the wrong choice. At that time, I was disappointed in myself and thought a lot about what it takes to build a sustainable, yet truly outstanding team. My thoughts and actions at that time haven’t changed very much now. I still expect co-founders, especially the CEO, to handle these difficult things. That’s why I started to think I should be the CEO. The OutsiderAfter my last team at Antler fell apart, I happened to connect with an entrepreneur from outside Antler through LinkedIn and we joined forces. This time, unlike my activities at Antler, we started by picking a product and building it. It felt strange to start with a ‘let’s just do it’ feeling from the outside after a long time. I was used to Antler’s method of spending a huge amount of time sharply defining the problem, so there was some discomfort. The item I was building at the time was a product I found hard to empathize with, but it wasn’t meant to be the team’s main thing, but rather a product to give the team experience in making money with an AI product. It took about 3 full weeks to build this product. On the day that marked the 4th week, I asked if I had been a good potential co-founder. For up to 3 weeks, we had built the planned product. They said it would be good to see a more proactive approach to building the product (the exact wording was different, but it was something to that effect). And that it was difficult to judge based on my current performance. As I asked, I expected that answer, but if the proactive attitude they mentioned hadn’t been visible by the 4th week, I wondered if I could ever show it to their satisfaction later. And most importantly, the official Antler program was about to end, and my chances of finding a co-founder were dwindling, so I decided to end our trial there and left the team. As a result, we didn’t end up founding a company together due to my relative shortcomings. I didn’t think I was really lacking the abilities they mentioned. But in the end, it was something I failed to show, so I started to think about how I should work to make these parts stand out, and why they didn’t. The CEO offered to pay me a salary for the work I’d done, but it felt weird for me to ask for money since I was also a party who had agreed to work together… and it’s not like we had any results… I tried to wrap it up by saying, “I’m sure there will be a time when I need your help next time,” but it ended with the CEO treating me to a very expensive meal. When we were working together, the CEO mentioned that they ‘have a lot of people who help them because they have built up good social capital,’ and I thought that if they have worked like this for many years, their social capital would be well-established. Even though we aren’t founding a company together, I thought it would be nice to stay in touch and see them from time to time. Of course, they didn’t say their social capital was built because they buy nice meals. It was mainly acquired through their achievements, but social capital is a comprehensive thing. The desire to greet them from time to time is only faintly related to the delicious dinner they bought me. The product we built for 3 weeks kept getting hit with fierce rejection from iOS. I said I would help with the upload since it was finished, but I feel down about the fact that I just got a free meal and still haven’t been able to do it. The Prodigal Son ReturnsAfter trying my luck on the outside, I returned to Antler. At that time, I had two plans. Either find someone to co-found with again within Antler, or work on my own idea and build a product alone. First, I had a brief chat with people inside who I thought I might have good chemistry with. Among them, the person I had formed a team with first had resolved his narrowed domain issue and was also team-less, so we formed a team again and are working on something. Then and now, we’ve never had any particular issues, so we’re still building the product without any worries. So, one of my 2024 goals, finding a co-founder, has been resolved. There was a time when I didn’t log into the YC matching platform. Then YC sent me an email. It said that the median time for someone to find a co-founder is 100 days, and for 20% it takes 8 months. So, they said, don’t give up easily. I started my search in March, so it took me a little over 9 months. That’s a speed that puts me in the bottom 20%. I want to think of it as meeting people carefully without lowering my standards. If someone starts after finding a co-founder, you could say they’ve saved this period. However, I think trying to find a co-founder without quitting your job lowers the probability of creating a good team. Some people see having one foot out the door as a sign of a lack of commitment to starting a company and won’t even consider working with you. So, if I were to go back to the beginning of my startup journey with my current mindset, I wouldn’t decide to leave only after finding a co-founder. I learned a lot during the process of finding a co-founder and had experiences I wouldn’t have had if I had stayed at my company. So, if founder X is considering leaving because they don’t have a co-founder, I’d tell them to think carefully about whether a co-founder is really the source of their hesitation. And if there seems to be no other reason, I’d suggest they quit and search more actively. I remembered the content as ‘it takes 8 months on average,’ but looking it up again now, it says 20%. My perception changed to ‘I was much slower than average,’ but it didn’t have any psychological impact. I found one, that’s what matters~ The Quest for PMFBefore Antler, I attempted a few large projects, but at Antler, I trained on logically inferring the success or failure of a business before finding PMF. So, I didn’t have many experiences of actually building a product during the Antler period. But I learned quite a lot from this process as well. Fullstack AI: BA 6 months ~ BA 3 monthsStarting in March, I tried to build a Fullstack AI. At that time, I met a lot of pre-entrepreneurs, and one of the common pains was ‘I don’t have a developer, so I have to either hire one or outsource to build an initial product, both of which are time-consuming and very expensive.’ The specs they were talking about weren’t actually that difficult to build, but they said it would cost between 20-30 million won to outsource. At the time, I thought that with the current level of AI, I could manage a codebase of that spec. As always, practice is different from theory. To be precise, it’s not that it’s different from theory, but that in reality, there are many more factors to consider. Uploading the entire codebase has context size issues, and even if you use a model that can handle a million tokens, there are cost issues. And most importantly, having to constantly test imprecise results for a programming language that needs to be precise was also a problem. But it’s still not impossible. If you pipeline the thinking process a developer uses to write API code into several stages for the AI, you can produce meaningful results. The debugging process can also be created as a cycle of compiling the code, and if a compile error occurs, passing the error to the LLM and modifying the code. There are many teams trying this and many related papers, so I read a huge number of papers at this time and reached a service that could create a simple API server. It was usable for cases that only needed a server and a database. But it couldn’t handle things like OAuth or using cloud components. A thought that came to me while building was, ‘If I make about a thousand of these pipelines, I think it could run quite precisely.’ But the success of this wasn’t up to me, and I wondered if I should be doing business while expecting the cost and performance issues of AI to gradually improve. I also wondered what my edge would be against other teams taking on the same challenge, given my lack of capital and manpower. How long would it take me to create 1,000 advanced AI pipelines? Even if the product is incomplete, is it valuable to customers? It was hard to nod easily to those answers. While I was mulling over these things, I saw a signal that it would be okay to try another item, so I stopped this project and moved on to the next one. LLMOps - Flow: BA 3 months ~ BA 1 monthWhile working on the previous item, I tried to build an internal tool. This internal tool was a tool that made it easy to make LLM calls with multiple depths. While doing intensive research, I had to frequently change and test the LLM pipeline, and without this tool, I had to manage data structures and prompts in the code and also code the execution order, which was too time-consuming to repeat. It was a service like Dify and internally used Langgraph. The person who was helping with the project at the time said that an internal tool like this was essential for their company as well. So, I named this pipeline version management tool Flow and spent about a month and a half trying to advance it and find customers. I think I met about 10 teams as customers, and most of them felt the need to advance through LLM pipelining, but they were thinking, is it right now? Most services were using LLM calls in a very simple, single-call way. This was true for everyone, from large companies applying AI to some features to small startups where AI was the main feature. I found it harder than expected to find people doing business that required complex use of AI. However, the customer interviews gave me some good insights, and I thought I could build a product that solved a bigger problem than what Flow was solving. All the customers said the same thing. They want to manage prompts well. They want to arrive at good quality prompts quickly. LLMOps - Platea AI: BA 1 month ~ AA 0 month Most of the teams I interviewed managed and evaluated prompts using Notion or spreadsheets. They created a database to manage Prompt, Input, Output, and Evaluation values and shared it among team members. This was actually more of a worksheet for collaboration. I felt a lack of a collaboration layer between the domain experts who had to write and test prompts and the developers. And basically, it was not easy to set up an environment to test several major models. They wanted to quickly compare the results of Claude, Gemini, and OpenAI models, but the method was to run each one once, gather the results, and evaluate them. One of the people who helped with the interviews, Mr. O, the CEO of a team that I think is making really good AI products in Korea, showed me the collaboration tool they made and are using in their team. It’s a very simple tool that represents N prompts and M datasets in an NxM table for parallel execution. You can see the results of multiple prompts with different models and settings at once. However, since it was a service that only worked locally, he said that if I could just make it collaborative, his team would use it. I thought it was a very realistic problem, one that I could build and deliver quickly, and that could solve the problems of many teams. So I built it in 2 weeks and just brought it to them. And I introduced it to the various teams I had interviewed. But I didn’t get as much conversion as I expected. Before entering Antler, I thought about delivering it to more customers, and if no payment occurred, I thought it wasn’t a really important problem, so I attached Paypal and posted it on Product Hunt. It wasn’t particularly targeted, but no payment occurred, so I didn’t advance it any further. The time I posted it was after I had already joined Antler. Recently, I’ve been seeing some products that are similar to Platea AI and look a bit more advanced. I think because this problem is so clear, many competing products are emerging. I wanted to hold onto this a little longer, but I decided to focus more on finding a co-founder while participating in Antler. Items Tossed Around in Q4If I were to list all the items I tossed around in Q4, I think it would break the 1,000,000-character limit, so I can’t write them all down. At Antler, they train founders on a way of thinking, or a framework, for finding ideas. This method isn’t particularly unique, but it’s a rational way to figure out what the real problem is, which everyone thinks about. Personally, I think it’s very similar to training on the ‘Five Whys’ in great detail. You need to define whose problem it is, find what isn’t solved by alternatives, and find out why those alternatives still haven’t solved it. Why aren’t the big companies doing it? Why have the existing alternatives left this part unsolved? Asking these questions helps you understand the real difficulties in solving this problem. Before Antler, when this topic came up, I think I heard things like ‘big companies don’t do this stuff’ or ‘people are just used to the current situation’ the most. In reality, this might often be the case, but it’s also arrogant to think that my idea is the first, and thinking in advance about what is truly difficult that has left this unsolved helps when thinking about a solution. Of course, it’s not that you can’t start just because it’s hard to answer these things. When you search like this, finding an item becomes really difficult. Of course, this framework isn’t always the answer. You can’t not start a business just because you can’t answer every question. But business is difficult even if we answer these questions perfectly. So, I think starting with this sharp focus helps increase the survival rate. What I’m Trying NowWhat I’m trying now is to get into the cycle of managing, consuming, and reproducing information. It’s a B2C product, and it’s still not clear who the people who are having a very big problem in this area are. However, we are people who are very interested in this cycle, and I think we can make a product that provides practical help to people who make money from the content collection to reproduction cycle. I also felt that it’s a relatively easy area to expand into a global product. It’s okay if we fail to find a market fit for this product… we can just go out and find another one… In 2025This year, I need to work hard to achieve the goal of finding PMF that I couldn’t achieve last year. I want to build a product with over 100,000 MAU and achieve $50,000 in monthly recurring revenue. And continuing from last year, I’ve set a goal for reading books. I’m going to aim to read 5 more books than last year. And I will try to regain the health I lost… There were so many events this year that even though I only included the core things I really wanted to record, it turned out to be a very long post. I think I need to write a little in between.","link":"/posts/logs/20250101/"},{"title":"Startup Log: Day 100","text":"About 100 days have passed since the last retrospective. I wanted to write this after 90 days, but with each day being so hectic, it’s been difficult to even keep records. Rize broke through the 80-hour workweek. However, we are not making progress. Can there only be good days? We are working like dogs, but it seems like it’s time to question if we are doing it well. PartnersWe have three new partners on our team. I am truly grateful that they believed in our team when we had nothing. I asked several people around me for reference checks, and I put a lot of thought into who would know me best before reaching out. I asked people who had formed a team with me but it didn’t work out, people I had co-founded a business with in the past, and people I had worked with as a developer. I believe we have these partners now because there were at least some good things said about me. I had a great time catching up with the CEO, friends, and colleagues from my past startup. When I first started the business, I had the idea that we absolutely had to find something like PMF (Product-Market Fit) and then get investment, but that didn’t happen, which feels a bit strange. It adds a bit more anxiety. I feel a greater sense of responsibility, especially because I believe this relationship was formed based on their faith in ‘who we are’ rather than ‘what we do’. Going to the USLike naive youngest children, we have been saying that we will target the global market and work in the US. When we said this in Korea, the most common question we got was, ‘What are you going to do in the US?’ We discussed this internally often, questioning, ‘Is there a real reason we have to go to the US?’ I was particularly worried, thinking, ‘What is the absolute reason we have to go to the US?’, ‘Do we have to go and spend more money?’ In fact, our customers are not only in the US, and we were meeting almost all of them via Google Meet, so there was no absolute necessity to be in the US. But as luck would have it, one of our partner teams could provide us with residency support in the US, so for us, who had no salaries, it became a situation where ‘we could work in the US for about the cost of an office.’ Although we received help, it was not confirmed, so we failed to get the residency support. There was a meeting where we had to explain why we needed US residency support, and I think our ‘absolute reason for going’ was not as convincing as other teams’. Of course, we could have appealed more that we were the team that really needed it, but I don’t think we are the kind of people who are good at making something sound plausible when we don’t even believe it ourselves internally. When we were dreaming of getting the support, we thought we would gain a definite advantage, but after failing to get it, our mindset shifted to thinking that we really had to do well. My co-founder also had such concerns, but he said, If we really want to do a global business well, it makes sense to do it in the place with the highest density of talent and where the most global businesses are created. If we were Americans, it would be so natural to start a business there, so we probably don’t need to find a reason why we must do it in the US. We talked a lot with other startup teams who went to SF with the attitude of ‘let’s just go and do something,’ and they also said, ‘There were many things to learn that are hard to explain in words, and if we went back to that time, we would make the same choice.’ They said you could see an infinite number of people involved in startups, and there were so many random opportunities. Sometimes when I brought this up, some senior entrepreneurs would look at me with an expression of ‘you naive kids…’ and give sincere advice. However, I think we moved forward with the expectation of exploring the secrets that statistics hold and the random opportunities. It has now been about 16 days since we arrived in the US. What Happened Before Going to the USThe way we find our item has been constantly changing before April, from April to July, and now. The story I’m about to write has changed a bit from my current thinking, but I’ve tried to record it as I thought at the time as much as possible. Creating 2D AnimationCreating 2D animations from a novelist’s work faced several difficulties. The novelists were satisfied that visual content was being created without any special effort on their part, but the viewers were not. Some fans of the novels definitely watched the work with the attitude of ‘Wow, my favorite novel has become an animation!’ However, creating something that would also interest the general public was a problem beyond technology. Our team lacked what it took to produce good quality. We were people who enjoyed a lot of content, but we had no experience creating it. We had a sense of ‘this scene is awkward,’ but we had a very poor sense of how to make good content. Converting a novel into a visual-centric content was difficult beyond just generating a video. We came to think of this as the realm of directing. We saw that existing AI animation creators could also create good quality videos, but the reason they couldn’t create continuous works like webtoon artists or novelists was because they still lacked the ability to create stories or direct them. Since the currently active AI animation creators are mostly hobbyist creators in a tech-friendly environment like us, they lacked experience in creating such stories. It’s like the very, very early days of webtoon artists where the directing, writing, and drawing parts were separated. So we outsourced one director to re-direct an existing work. When we outsourced to a junior-level animation director, the quality was definitely better than ours, but it was hard to say it was a definite improvement. Our next concern was divided into two paths. Entrust part of the content production process to experts and gradually reduce costs through automation: The field of video production can still be produced more cost-effectively and quickly than the existing industry because it is still produced by AI. It would be like Reelshort for Animation. But there are too few opportunities to experiment. Roughly calculated, we would fail if we couldn’t get results within 10 works. Provide a tool for creating low-quality, low-engagement content to everyone and gradually improve the quality: Take the existing internal tool, refine it to be a bit easier to use, and let users act as prosumers. Gradually increase the quality to a reasonable level of animation content. But I don’t know who would use it. We judged that our chances of success with the first option were very low. We thought we were better at refining software, and after a long period of discussion and deliberation, we decided to go with the second direction. Lovable for Video CreationWe created a video content generation agent that follows the workflow of the tools we used internally. It was a product that handled workflows that couldn’t be solved with a simple video model alone, such as adding BGM for video creation, continuously producing consistent videos, and creating videos with the same voice. We didn’t want to be building this in the US, so we quickly made it in two weeks and started looking for customers. Within the team, we thought that the value we provide is somewhat ambiguous with just verbal explanations, so we thought that users would feel the value only if we showed them something that works. Of course, the version we whipped up was full of bugs and had technical issues due to the long video creation process, making it difficult to onboard users, but we thought we could at least convey the feeling. However, customers did not feel the value without seeing the result, and it seems we spent about a week fixing bugs even after coming to the US. I have a long-standing question about the underlined part. Is it really so? Our first target customers were content creators on X. Their main activity is to try out content generation AI products and post content like “It’s cooking” or “It’s over.” They were people who created many small examples and sold affiliates, lectures, etc., to their subscribers. These people only needed to post short examples and were not creating videos with a specific purpose, so our tool was essentially just a product below Veo3 and had no utility. It was not a very “cooking” product. The next target customers we met were people who created low-engagement AI content on Tiktok. We thought these people would be a good fit for our requirements, but they felt uncomfortable that our tool took away the controller of their existing workflow, resulting in videos of a different quality than the ones they were making. They seemed to have a good reaction to the part where you could just say anything and it would be made well, but the quality of the videos they were making now didn’t require a very consistent voice for every video or a very elaborate series. It was enough to have a Bigfoot saying funny lines, so the value we provided was less than what they could get from just whipping something up with Veo3. 3D AI CompanionWhile we were contemplating our next customer segment, we briefly delved into 3D AI Companion at the strong suggestion of my co-founder. It was so sudden, but Ani had made Grok the number one app in Japan, and he thought that the virality of 3D Companion was so high that a service that could quickly ride the wave would emerge. The idea was that while characters in current 3D Companion apps are not customizable, we could create a service where anyone can create their desired character and use it as a companion. So, we spent about 3.5 days in crunch mode exploring the quality of the flow of creating a 3D model from an image, rigging it, and animating it. The result was a very disappointing quality. We thought that the visual aspect was the core of a 3D Companion service and that we couldn’t provide value at this level. So, we returned to the point where we had failed to find customers for Lovable for Video Creation. Work and Thoughts So FarFrom April until now, we have focused on ‘what we can do for a long time’ and ‘the field we are interested in.’ Rather than asking ‘what is the problem?’, we have mainly focused on what kind of future we envision and how we can create it. So, we have been creating a general product, looking for people, trying a different approach if it doesn’t work, failing, and repeating this process. There is a problem with this method: it is very difficult to find an entry point by creating a non-specific product and then finding people who feel even a little bit of value in it to make it more specific. This approach seems to be taken especially when approaching B2C. Internally, we are considering exploring various items with a more open mind, but returning to the method we used from January to March, where the customer is clearly defined. We have decided to meet more people in SF for a while and get new input to look for various problems.","link":"/posts/logs/20250724/"}],"tags":[{"name":"log","slug":"log","link":"/tags/log/"},{"name":"retrospect","slug":"retrospect","link":"/tags/retrospect/"}],"categories":[{"name":"logs","slug":"logs","link":"/categories/logs/"}],"pages":[{"title":"About","text":"Founder &amp; Engineer Self learner Link Github Email: changhoi0522@gmail.com","link":"/about"}]}